Revit 2024 API
BuiltInFailures.ViewFailures.InsertColumnViewError Property
 Column cannot be placed in Elevation or Section view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InsertColumnViewError { get; }
Visual Basic
Public Shared ReadOnly Property InsertColumnViewError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InsertColumnViewError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace